index.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2019-12-09 Mon 23:34 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>&lrm;</title>
<meta name="generator" content="Org mode" />
<meta name="author" content="Sam Partee" />
<link rel="stylesheet" type="text/css" href="https://fniessen.github.io/org-html-themes/styles/readtheorg/css/htmlize.css"/>
<link rel="stylesheet" type="text/css" href="https://fniessen.github.io/org-html-themes/styles/readtheorg/css/readtheorg.css"/>
</head>
<body>
<div id="content">
<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#org0faef0b">1. NeurIPS 2019</a>
<ul>
<li><a href="#orgcd1575b">1.1. Sunday</a>
<ul>
<li><a href="#org77a3a31">1.1.1. Habana Labs</a></li>
<li><a href="#orgcd7b3aa">1.1.2. Facebook Hardware</a></li>
<li><a href="#orgdd5bf8d">1.1.3. ML in Finance</a></li>
</ul>
</li>
<li><a href="#org4425404">1.2. Monday (tutorials)</a>
<ul>
<li><a href="#org0461d15">1.2.1. Deep Learning with Bayesian Principles</a></li>
<li><a href="#org54a768e">1.2.2. Efficent Processing of Deep Neural Network</a></li>
<li><a href="#orga4d03bf">1.2.3. Reinforcement Learning: Past, Present, and future Prospectives</a></li>
</ul>
</li>
<li><a href="#orge4a392f">1.3. Tuesday</a>
<ul>
<li><a href="#org2b0854c">1.3.1. Logarithmic Regret for Online Control</a></li>
<li><a href="#orgc63ad6f">1.3.2. Legendre Memory Units: Continuous Time Representation in RNNs</a></li>
<li><a href="#org273e2b8">1.3.3. Point Voxel CNN for Efficent 3D Deep Learning</a></li>
<li><a href="#orgba41485">1.3.4. Neural Networks with Cheap Differential Operators</a></li>
<li><a href="#orgcd2e848">1.3.5. Sequential Neural Processes</a></li>
<li><a href="#org1c0ea87">1.3.6. Conditional Independance Testing Using GANs</a></li>
<li><a href="#org69ba98e">1.3.7. Causal Confusion in Imitation Learning</a></li>
<li><a href="#org6e3d40c">1.3.8. Reducing the Varience in Online Optimization by Transporting Past Gradients</a></li>
<li><a href="#org50a8a46">1.3.9. SySCD: A System-Aware Parallel Coordinate Descent Algorithm</a></li>
<li><a href="#org194245a">1.3.10. Tight Regret Bounds for Model-Based Reinforcement Learning with Greedy Policies</a></li>
<li><a href="#org63e99e4">1.3.11. Hindsight Credit Assignment</a></li>
<li><a href="#orgba6f84f">1.3.12. Weight Agnostic Neural Networks</a></li>
</ul>
</li>
<li><a href="#org2ecd421">1.4. Wednesday</a>
<ul>
<li><a href="#orgf688a93">1.4.1. Scene Representation Networks: Continuous 3D-Structure-Aware Neural Scene Representations</a></li>
<li><a href="#orgbcbfcd7">1.4.2. Principal Component Projection and Regression in Nearly Linear Time through Asymmetric SVRG</a></li>
<li><a href="#org6d00b99">1.4.3. PIDForest: Anomaly Detection via Partial Identification</a></li>
<li><a href="#orgbd6d3b1">1.4.4. Guided Similarity Seperation for Image Retrieval</a></li>
<li><a href="#org94e6192">1.4.5. CNAPs: Fast and Flexible Multi-Task Classification Using Conditional Neural Adaptive Processes</a></li>
<li><a href="#org0886572">1.4.6. Beyond Online Balanced Descent: An Optimal Algorithmfor Smoothed Online Convex Optimization</a></li>
</ul>
</li>
</ul>
</li>
</ul>
</div>
</div>

<div id="outline-container-org0faef0b" class="outline-2">
<h2 id="org0faef0b"><span class="section-number-2">1</span> NeurIPS 2019</h2>
<div class="outline-text-2" id="text-1">
<p>
This repository is a collection of the papers and my notes from attended talks
and other various parts of NeurIPS 2019. I created this repository mostly for my
own sake, but also because I found it painstaking to find the papers and slides
for the various talks I wanted to go to. Included also are my personal notes that
will be updated as the week goes on.
</p>
</div>

<div id="outline-container-orgcd1575b" class="outline-3">
<h3 id="orgcd1575b"><span class="section-number-3">1.1</span> Sunday</h3>
<div class="outline-text-3" id="text-1-1">
</div>
<div id="outline-container-org77a3a31" class="outline-4">
<h4 id="org77a3a31"><span class="section-number-4">1.1.1</span> Habana Labs</h4>
<div class="outline-text-4" id="text-1-1-1">
<ul class="org-ul">
<li><a href="./habana-labs.html">Notes</a></li>
<li>Talk was a brief showcase of the Habana Goya Inference Processor.
If youre not familiar with this type of processor, they allow you
to fine-tune the inference of your model by reducing the precision
of your model without accuracy lost. This sentence liberally taken
from the Nvidia website and summerizes the importance of reduced
precision:</li>
</ul>
<p class="verse">
Reduced precision inference significantly reduces application<br />
latency, which is a requirement for many real-time services,<br />
auto and embedded applications.<br />
</p>
</div>
</div>
<div id="outline-container-orgcd7b3aa" class="outline-4">
<h4 id="orgcd7b3aa"><span class="section-number-4">1.1.2</span> Facebook Hardware</h4>
<div class="outline-text-4" id="text-1-1-2">
<ul class="org-ul">
<li><a href="./facebook-hardware.html">Notes</a></li>
<li>Very interesting talk on the Open Accelerator Intrastructure. Couldn't
stay for the whole thing, but the jist of it is that the OAI stack brings
an open source software feel to hardware. The stack aims to reduce the
time to integration for AI systems. There is an impressive number of
companies behind it including Habana. I couldl't stay for whole talk, but
for more detail see link below.</li>
<li><a href="https://www.opencompute.org/blog/new-open-accelerator-infrastructure-oai-sub-project-to-launch-within-the-ocp-server-project">OAI</a></li>
</ul>
</div>
</div>
<div id="outline-container-orgdd5bf8d" class="outline-4">
<h4 id="orgdd5bf8d"><span class="section-number-4">1.1.3</span> ML in Finance</h4>
<div class="outline-text-4" id="text-1-1-3">
<ul class="org-ul">
<li><a href="./ML-in-finance.html">Notes</a></li>
<li>Personal Note: Two Sigma folks were very nice and approachable.</li>
<li>Attend the end of the J.P. Morgan talk and the Two Sigma talk in
this session. Both were very high level talks about ML in finance.
J.P. Morgan covered the basics of RL and their application to
financial data. Two Sigma's talk broke down different uses of ML
for finding opportunies within the market. They provided an
example of how break down an instagram photo into consumable
data for CNNs(object-recognition) and LSTMs(sentiment analysis).
The process of training forecasting models was also covered.</li>
</ul>
</div>
</div>
</div>
<div id="outline-container-org4425404" class="outline-3">
<h3 id="org4425404"><span class="section-number-3">1.2</span> Monday (tutorials)</h3>
<div class="outline-text-3" id="text-1-2">
</div>
<div id="outline-container-org0461d15" class="outline-4">
<h4 id="org0461d15"><span class="section-number-4">1.2.1</span> Deep Learning with Bayesian Principles</h4>
<div class="outline-text-4" id="text-1-2-1">
<ul class="org-ul">
<li><a href="./DL-with-Bayesian-Principles.html">Notes</a></li>
<li>Author, Mohammad Emtiyaz Khan, focused on the benefits of combining Bayesian Learning
and Deep Learning approaches. He showed how to derive common DL optimizers like
Adam and RMSProp from Bayesian principles. Khan stressed the importance of such
Bayesian principles in lifelong learning. This talk was one of my favorites because
Khan did a great job of distilling the benefits of Bayesian Learning into well explained
equations.</li>
</ul>
</div>
</div>
<div id="outline-container-org54a768e" class="outline-4">
<h4 id="org54a768e"><span class="section-number-4">1.2.2</span> Efficent Processing of Deep Neural Network</h4>
<div class="outline-text-4" id="text-1-2-2">
<ul class="org-ul">
<li><a href="./nn-processing.html">Notes</a></li>
<li>Vivenne Sze discussed the various processing methods available and being researched
for AI computation. Specifically, Sze drilled home the impact of reads from DRAM in
training. This talk was quite dense and covered many aspects of AI processing from
chip specifics to co-design and Neural Architecture Search (NAS).</li>
</ul>
</div>
</div>
<div id="outline-container-orga4d03bf" class="outline-4">
<h4 id="orga4d03bf"><span class="section-number-4">1.2.3</span> Reinforcement Learning: Past, Present, and future Prospectives</h4>
<div class="outline-text-4" id="text-1-2-3">
<ul class="org-ul">
<li><a href="./RL-overview.html">Notes</a></li>
<li>Katja Hofmann, a part of Microsoft Research, talked about Reinforcement Learning (Rl) from
inception to standard practice. Hofmann outlined Deep Q-Learning and some improvements that
have been made to the method such as Boostrapped DQNs from Osband et al. (2018). She then
explained the Actor Critic model and shared a number of papers I am going to go read.</li>
</ul>
</div>
</div>
</div>
<div id="outline-container-orge4a392f" class="outline-3">
<h3 id="orge4a392f"><span class="section-number-3">1.3</span> Tuesday</h3>
<div class="outline-text-3" id="text-1-3">
</div>
<div id="outline-container-org2b0854c" class="outline-4">
<h4 id="org2b0854c"><span class="section-number-4">1.3.1</span> Logarithmic Regret for Online Control</h4>
<div class="outline-text-4" id="text-1-3-1">
<ul class="org-ul">
<li><a href="https://i-am-karan-singh.github.io/docs/log-control/summary.pdf">slides</a></li>
</ul>
</div>
</div>
<div id="outline-container-orgc63ad6f" class="outline-4">
<h4 id="orgc63ad6f"><span class="section-number-4">1.3.2</span> Legendre Memory Units: Continuous Time Representation in RNNs</h4>
<div class="outline-text-4" id="text-1-3-2">
<ul class="org-ul">
<li><a href="https://docs.google.com/document/d/1uarYP9YqcKx2Qh7sHJJhrY87C-mVZbNTAVqRKVPDXmI/edit">supplementary material</a></li>
</ul>
</div>
</div>
<div id="outline-container-org273e2b8" class="outline-4">
<h4 id="org273e2b8"><span class="section-number-4">1.3.3</span> Point Voxel CNN for Efficent 3D Deep Learning</h4>
<div class="outline-text-4" id="text-1-3-3">
<ul class="org-ul">
<li><a href="https://hanlab.mit.edu/projects/pvcnn/">site</a></li>
<li><a href="./Point-Voxel-3D-DL.pdf">paper</a></li>
</ul>
</div>
</div>
<div id="outline-container-orgba41485" class="outline-4">
<h4 id="orgba41485"><span class="section-number-4">1.3.4</span> Neural Networks with Cheap Differential Operators</h4>
</div>
<div id="outline-container-orgcd2e848" class="outline-4">
<h4 id="orgcd2e848"><span class="section-number-4">1.3.5</span> Sequential Neural Processes</h4>
</div>
<div id="outline-container-org1c0ea87" class="outline-4">
<h4 id="org1c0ea87"><span class="section-number-4">1.3.6</span> Conditional Independance Testing Using GANs</h4>
<div class="outline-text-4" id="text-1-3-6">
<ul class="org-ul">
<li><a href="https://neurips.cc/media/Slides/nips/2019/westballsa+b(10-10-05)-10-10-40-15681-conditional_ind.pdf">slides</a></li>
</ul>
</div>
</div>
<div id="outline-container-org69ba98e" class="outline-4">
<h4 id="org69ba98e"><span class="section-number-4">1.3.7</span> Causal Confusion in Imitation Learning</h4>
<div class="outline-text-4" id="text-1-3-7">
<ul class="org-ul">
<li><a href="https://sites.google.com/view/causal-confusion">site</a></li>
<li><a href="./Causal-Confusion.pdf">paper</a></li>
<li><a href="https://github.com/pimdh/causal-confusion">code</a></li>
</ul>
</div>
</div>
<div id="outline-container-org6e3d40c" class="outline-4">
<h4 id="org6e3d40c"><span class="section-number-4">1.3.8</span> Reducing the Varience in Online Optimization by Transporting Past Gradients</h4>
<div class="outline-text-4" id="text-1-3-8">
<ul class="org-ul">
<li><a href="./Implicit-Gradient-Transport.pdf">paper</a></li>
</ul>
</div>
</div>
<div id="outline-container-org50a8a46" class="outline-4">
<h4 id="org50a8a46"><span class="section-number-4">1.3.9</span> SySCD: A System-Aware Parallel Coordinate Descent Algorithm</h4>
<div class="outline-text-4" id="text-1-3-9">
<ul class="org-ul">
<li><a href="https://neurips.cc/media/Slides/nips/2019/westexhibitionhallb(10-16-10)-10-17-05-15802-syscd_a_system.pdf">slides</a></li>
<li><a href="https://www.zurich.ibm.com/snapml/neurips19/SySCD-poster-neurips19.pdf">poster</a></li>
</ul>
</div>
</div>
<div id="outline-container-org194245a" class="outline-4">
<h4 id="org194245a"><span class="section-number-4">1.3.10</span> Tight Regret Bounds for Model-Based Reinforcement Learning with Greedy Policies</h4>
<div class="outline-text-4" id="text-1-3-10">
<ul class="org-ul">
<li><a href="https://neurips.cc/media/Slides/nips/2019/westballsa+b(10-16-10)-10-17-15-15692-tight_regret_bo.pdf">slides</a></li>
</ul>
</div>
</div>
<div id="outline-container-org63e99e4" class="outline-4">
<h4 id="org63e99e4"><span class="section-number-4">1.3.11</span> Hindsight Credit Assignment</h4>
<div class="outline-text-4" id="text-1-3-11">
<ul class="org-ul">
<li><a href="https://www.youtube.com/watch?v=2EnckznIV2o&amp;feature=youtu.be">Video</a></li>
<li><a href="https://neurips.cc/media/Slides/nips/2019/westballa+b(10-16-10)-10-17-20-15693-hindsight_credi.pdf">slides</a></li>
</ul>
</div>
</div>
<div id="outline-container-orgba6f84f" class="outline-4">
<h4 id="orgba6f84f"><span class="section-number-4">1.3.12</span> Weight Agnostic Neural Networks</h4>
<div class="outline-text-4" id="text-1-3-12">
<ul class="org-ul">
<li><a href="./weight-agnostic-nn.pdf">paper</a></li>
<li><a href="https://weightagnostic.github.io/slides/wann_slides.pdf">Slides</a></li>
<li><a href="https://weightagnostic.github.io/">site</a></li>
<li>Questions the importance of architechture in the learning process. Makes the
comparison to Precocial species who have certain abilities provided at birth.</li>
<li>Shows that a neural architechture search can perform on multiple reinforcement
learning and supervised learning tasks.</li>
<li>Based on NEAT</li>
</ul>
</div>
</div>
</div>
<div id="outline-container-org2ecd421" class="outline-3">
<h3 id="org2ecd421"><span class="section-number-3">1.4</span> Wednesday</h3>
<div class="outline-text-3" id="text-1-4">
</div>
<div id="outline-container-orgf688a93" class="outline-4">
<h4 id="orgf688a93"><span class="section-number-4">1.4.1</span> Scene Representation Networks: Continuous 3D-Structure-Aware Neural Scene Representations</h4>
<div class="outline-text-4" id="text-1-4-1">
<ul class="org-ul">
<li><a href="https://vsitzmann.github.io/srns/video/">video</a></li>
<li><a href="https://vsitzmann.github.io/srns/slides.pdf">slides</a></li>
<li><a href="./Scene-Representation-Networks.pdf">paper</a></li>
<li><a href="https://vsitzmann.github.io/">Author Github.io</a></li>
</ul>
</div>
</div>
<div id="outline-container-orgbcbfcd7" class="outline-4">
<h4 id="orgbcbfcd7"><span class="section-number-4">1.4.2</span> Principal Component Projection and Regression in Nearly Linear Time through Asymmetric SVRG</h4>
<div class="outline-text-4" id="text-1-4-2">
<ul class="org-ul">
<li><a href="https://neurips.cc/media/Slides/nips/2019/westballsa+b(11-10-05)-11-10-35-15700-principal_compo.pdf">slides</a></li>
<li><a href="./PCA-SVRG.pdf">paper</a></li>
</ul>
</div>
</div>
<div id="outline-container-org6d00b99" class="outline-4">
<h4 id="org6d00b99"><span class="section-number-4">1.4.3</span> PIDForest: Anomaly Detection via Partial Identification</h4>
<div class="outline-text-4" id="text-1-4-3">
<ul class="org-ul">
<li><a href="https://neurips.cc/media/Slides/nips/2019/westballsa+b(11-10-05)-11-10-40-15701-pidforest_anom.pdf">slides</a></li>
<li><a href="./pidforest.pdf">paper</a></li>
</ul>
</div>
</div>
<div id="outline-container-orgbd6d3b1" class="outline-4">
<h4 id="orgbd6d3b1"><span class="section-number-4">1.4.4</span> Guided Similarity Seperation for Image Retrieval</h4>
<div class="outline-text-4" id="text-1-4-4">
<ul class="org-ul">
<li><a href="./Guided-Similarity-Seperation.pdf">paper</a></li>
</ul>
</div>
</div>
<div id="outline-container-org94e6192" class="outline-4">
<h4 id="org94e6192"><span class="section-number-4">1.4.5</span> CNAPs: Fast and Flexible Multi-Task Classification Using Conditional Neural Adaptive Processes</h4>
<div class="outline-text-4" id="text-1-4-5">
<ul class="org-ul">
<li><a href="./multi-task-class-CNAP.pdf">paper</a></li>
<li><a href="https://neurips.cc/media/Slides/nips/2019/westballsa+b(11-15-50)-11-16-05-15704-fast_and_flexib.pdf">slides</a></li>
</ul>
</div>
</div>

<div id="outline-container-org0886572" class="outline-4">
<h4 id="org0886572"><span class="section-number-4">1.4.6</span> Beyond Online Balanced Descent: An Optimal Algorithmfor Smoothed Online Convex Optimization</h4>
<div class="outline-text-4" id="text-1-4-6">
<ul class="org-ul">
<li><a href="https://neurips.cc/media/Slides/nips/2019/westexhibitionhallb(11-15-50)-11-16-40-15821-beyond_online_b.pdf">slides</a></li>
<li><a href="./Online-balanced-descent.pdf">paper</a></li>
</ul>
</div>
</div>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="author">Author: Sam Partee</p>
<p class="date">Created: 2019-12-09 Mon 23:34</p>
<p class="validation"><a href="http://validator.w3.org/check?uri=referer">Validate</a></p>
</div>
</body>
</html>
